import * as React from 'react';

const EyeIcon = (props)=>{
    return(
        <svg xmlns="http://www.w3.org/2000/svg" width="20" height="16.106" viewBox="0 0 20 16.106" {...props}>
            <g id="그룹_19" data-name="그룹 19" transform="translate(-2 -4)">
                <path id="패스_96" data-name="패스 96" d="M12,9.641a2.411,2.411,0,1,0,2.412,2.412A2.414,2.414,0,0,0,12,9.641Zm0,6.322a3.911,3.911,0,1,1,3.912-3.91A3.915,3.915,0,0,1,12,15.963Z" fill="#130f26" fillRule="evenodd"/>
                <g id="그룹_18" data-name="그룹 18">
                <path id="패스_97" data-name="패스 97" d="M3.57,12.052C5.43,16.162,8.563,18.6,12,18.605s6.57-2.444,8.43-6.553C18.57,7.945,15.437,5.5,12,5.5S5.43,7.945,3.57,12.052ZM12,20.105H12c-4.136,0-7.85-2.9-9.936-7.757a.751.751,0,0,1,0-.592C4.147,6.9,7.862,4,12,4c0,0,0,0,0,0s0,0,0,0c4.136,0,7.85,2.9,9.936,7.756a.743.743,0,0,1,0,.592C19.854,17.2,16.139,20.1,12,20.105Z" fill="#130f26" fillRule="evenodd"/>
                </g>
            </g>
        </svg>
    );
}

export default EyeIcon;